Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: There is another guide if you need a xref:resteasy-client.adoc[REST client based on RESTEasy Classic] (including support for JSON).
ja_jp: RESTEasy Classic をベースにした REST クライアント (JSON のサポートを含む) が必要な場合は、xref:resteasy-client.adoc[別のガイド] を参照してください。

source: There is more than one way to fix the example:
ja_jp: 例の修正方法は1つではありません:

source: There is no OpenTracing specific code in the generated project, but the `smallrye-opentracing` extension is present and enabled by default, and it will automatically instrument the code.
ja_jp: 生成されたプロジェクトには OpenTracing 固有のコードはありませんが、 `smallrye-opentracing` エクステンションが存在し、デフォルトで有効になっているため、コードが自動的にインストルメント化されます。

source: There is no equivalent in JAX-RS. Annotating a class with @Path suffices
ja_jp: JAX-RSにはこれに相当するものはありません。クラスのアノテーションは@Pathで十分です。

source: There is no equivalent in Jakarta REST. Annotating a class with @Path suffices
ja_jp: Jakarta RESTには同等のものはありません。クラスを@Pathでアノテーションするので十分です。

source: There is no need to declare dummy constructors for normal scoped bean in Quarkus - they are generated automatically. Also if there's only one constructor there is no need for `@Inject`.
ja_jp: Quarkusでは、通常のスコープ付き Bean のためにダミーのコンストラクターを宣言する必要はありません。自動的に生成されます。また、コンストラクターが 1 つしかない場合は、 `@Inject` の必要性はありません。

source: There is no need to declare dummy constructors for normal scoped bean in Quarkus - they are generated automatically. Also, if there's only one constructor there is no need for `@Inject`.
ja_jp: Quarkus では、通常のスコープ付き Bean のためにダミーのコンストラクターを宣言する必要はありません。自動的に生成されます。また、コンストラクターが 1 つしかない場合は、 `@Inject` の必要性はありません。

source: There is no need to set schemas. Quarkus detects them, and if none are found, generates them using appropriate schema types. Structured types like `Quote` bean use JSON schema.
ja_jp: スキーマを設定する必要はありません。 Quarkus はそれらを検出し、1 つも見つからない場合は適切なスキーマタイプを使用して生成します。 `Quote` Bean のような構造化型は JSON スキーマを使用します。

source: There is no need to set serializers or deserializers. Quarkus detects them, and if none are found, generates them using JSON serialization.
ja_jp: シリアライザーまたはデシリアライザーを設定する必要はありません。Quarkus はそれらを検出し、何も見つからない場合は、JSON シリアル化を使用してそれらを生成します。

source: There is no recommended way to generate observability events in Quarkus because the OpenTelemetry Events API is still under development and its use is not recommended, yet.
ja_jp: OpenTelemetry Events API はまだ開発中であり、その使用はまだ推奨されていないため、Quarkus でオブザーバビリティーイベントを生成するための推奨される方法はありません。

source: There is no standard concurrency control mechanism for CDI beans. Nevertheless, a bean instance can be shared and accessed concurrently from multiple threads. In that case it should be thread-safe. You can use standard Java constructs (`volatile`, `synchronized`, `ReadWriteLock`, etc.) or let the container control the concurrent access. Quarkus provides `@io.quarkus.arc.Lock` and a built-in interceptor for this interceptor binding. Each interceptor instance associated with a contextual instance of an intercepted bean holds a separate `ReadWriteLock` with non-fair ordering policy.
ja_jp: CDI Bean の標準的な同時実行制御メカニズムはありません。それにもかかわらず、Bean インスタンスは、複数のスレッドから同時に共有およびアクセスすることができます。その場合は、スレッドセーフでなければなりません。標準の Java コンストラクト (`volatile`、 `synchronized`、 `ReadWriteLock` など) を使用するか、コンテナーに同時アクセスを制御させることができます。Quarkus は、 `@io.quarkus.arc.Lock` と、このインターセプタ―バインディング用の組み込みインターセプターを提供します。傍受された Bean のコンテキストインスタンスに関連付けられた各インターセプターインスタンスは、公平でない順序付けポリシーを持つ `ReadWriteLock` を保持しています。

source: There is no standard concurrency control mechanism for CDI beans. Nevertheless, a bean instance can be shared and accessed concurrently from multiple threads. In that case, it should be thread-safe. You can use standard Java constructs (`volatile`, `synchronized`, `ReadWriteLock`, etc.) or let the container control the concurrent access. Quarkus provides `@io.quarkus.arc.Lock` and a built-in interceptor for this interceptor binding. Each interceptor instance associated with a contextual instance of an intercepted bean holds a separate `ReadWriteLock` with non-fair ordering policy.
ja_jp: CDI Bean には標準の同時実行制御メカニズムはありません。それにもかかわらず、Bean インスタンスは複数のスレッドから同時に共有され、アクセスできます。その場合、スレッドセーフである必要があります。標準の Java 構成 (`volatile`、`synchronized`、`ReadWriteLock` など) を使用するか、コンテナーに同時アクセスを制御させることができます。Quarkus は、`@io.quarkus.arc.Lock` と、このインターセプターバインディング用の組み込みインターセプターを提供します。インターセプトされた Bean のコンテキストインスタンスに関連付けられた各インターセプターインスタンスは、公平でない順序付けポリシーを持つ個別の `ReadWriteLock` を保持します。

source: There is no warmup phase, as the code is already compiled to native code. Performance is effectively at its peak from the start.
ja_jp: コードはすでにネイティブコードにコンパイルされているため、ウォームアップフェーズはありません。パフォーマンスは実質的に最初からピークに達します。

source: There is nothing special about the POM other than the inclusion of the `quarkus-amazon-lambda-http` extension (if you are deploying an AWS Gateway HTTP API) or the `quarkus-amazon-lambda-rest` extension (if you are deploy an AWS Gateway REST API). These extensions automatically generate everything you might need for your lambda deployment.
ja_jp: POM には `quarkus-amazon-lambda-http` エクステンション(AWS Gateway HTTP APIでデプロイしている場合) か `quarkus-amazon-lambda-rest` エクステンション( AWS Gateway REST APIでデプロイしている場合)が依存関係として含まれている以外に特別なことは何もありません。これらのエクステンションは Lambda のデプロイに必要なものをすべて自動的に生成します。

source: There is nothing special about the POM other than the inclusion of the `quarkus-amazon-lambda-http` extension (if you are deploying an AWS Gateway HTTP API) or the `quarkus-amazon-lambda-rest` extension (if you are deploying an AWS Gateway REST API). These extensions automatically generate everything you might need for your lambda deployment.
ja_jp: POM には `quarkus-amazon-lambda-http` エクステンション(AWS Gateway HTTP APIでデプロイしている場合) か `quarkus-amazon-lambda-rest` エクステンション( AWS Gateway REST APIでデプロイしている場合)が依存関係として含まれている以外に特別なことは何もありません。これらのエクステンションは Lambda のデプロイに必要なものをすべて自動的に生成します。

source: There is nothing special about the POM other than the inclusion of the `quarkus-amazon-lambda` extension as a dependency. The extension automatically generates everything you might need for your lambda deployment.
ja_jp: POM には `quarkus-amazon-lambda-http` エクステンションが依存関係として含まれている以外に特別なことは何もありません。このエクステンションは Lambda のデプロイに必要なものをすべて自動的に生成します。

source: There is nothing special about the POM other than the inclusion of the `quarkus-funqy-amazon-lambda` extension as a dependency. The extension automatically generates everything you might need for your lambda deployment.
ja_jp: POM には `quarkus-funqy-amazon-lambda` エクステンションが依存関係として含まれている以外に特別なことは何もありません。このエクステンションは Lambda のデプロイに必要なものをすべて自動的に生成します。

source: There is nothing special about the code and more importantly nothing AWS specific. Funqy functions can be deployed to many environments and AWS Lambda is one of them. The Java code is actually the same exact code as the link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
ja_jp: コードに特別なことはなく、AWS 固有のものもありません。Funqy 関数は多くの 環境にデプロイでき、AWS Lambda もその 1 つです。Java コードは、実際には link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart] とまったく同じコードです。

source: There is nothing special about the code and more importantly nothing AWS specific. Funqy functions can be deployed to many environments and AWS Lambda is one of them. The Java code is actually the same exact code as the {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
ja_jp: コードには何も特別なものはありませんし、もっと重要なのはAWSに特化したものは何もありません。Funqy関数は様々な環境にデプロイすることができ、AWS Lambdaもその一つです。Javaのコードは、実は {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart] と全く同じコードです。

source: There is nothing special about the code and more importantly nothing AWS specific. Funqy functions can be deployed to many different environments and AWS Lambda is one of them. The Java code is actually the same exact code as the {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
ja_jp: コードには何も特別なものはありませんし、もっと重要なのはAWSに特化したものは何もありません。Funqy関数は様々な環境にデプロイすることができ、AWS Lambdaもその一つです。Javaのコードは、実は{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart]と全く同じコードです。

source: There is nothing special about the code and more importantly nothing Google Cloud specific. Funqy functions can be deployed to many environments and Google Cloud Functions is one of them.
ja_jp: このコードには何も特別なものはありません。また、重要なこととして、Google Cloud に特化したものは何もありません。Funqy 関数はさまざまな環境にデプロイすることができ、Google Cloud Functions はそのうちの 1 つです。

source: There is nothing special about the code and more importantly nothing Google Cloud specific. Funqy functions can be deployed to many environments and Google Cloud Functions is one of them. The Java code is actually the same exact code as the link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
ja_jp: コードに特別なものはありませんし、もっと重要なのはGoogle Cloudに特化したものはないということです。Funqy関数は多くの環境にデプロイでき、Google Cloud Functionsもその一つです。Javaコードは実は link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart] と全く同じコードです。

source: There is nothing special about the code and more importantly nothing Google Cloud specific. Funqy functions can be deployed to many environments and Google Cloud Functions is one of them. The Java code is actually the same exact code as the {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
ja_jp: コードには何も特別なものはありませんし、もっと重要なのは Google Cloud に特化したものは何もありません。Funqy 関数はさまざまな環境にデプロイすることができ、Google Cloud Functions もその一つです。Java のコードは、実は {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart] と全く同じコードです。

source: There is nothing special about the code and more importantly nothing Google Cloud specific. Funqy functions can be deployed to many different environments and Google Cloud Functions is one of them.
ja_jp: このコードには何も特別なものはありません。また、重要なこととして、Google Cloud に特化したものは何もありません。Funqy 関数はさまざまな環境にデプロイすることができ、Google Cloud Functions はそのうちの 1 つです。

source: There is nothing special about the code and more importantly nothing Google Cloud specific. Funqy functions can be deployed to many different environments and Google Cloud Functions is one of them. The Java code is actually the same exact code as the {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
ja_jp: コードには何も特別なものはありませんし、もっと重要なのは Google Cloud に特化したものは何もありません。Funqy 関数はさまざまな環境にデプロイすることができ、Google Cloud Functions もその一つです。Java のコードは、実は {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart]と 全く同じコードです。

source: There is one case where `@Named` is the right thing to use: specifying an external identifier for a different language that doesn't support dependency injection directly.
ja_jp: `@Named` を使用するのが正しいケースが 1 つあります。それは、依存性注入を直接サポートしない異なる言語のために外部識別子を指定する場合です。

source: There is one change though: if you aren't doing so already, you will need to explicitly add the `quarkus-resteasy-jackson` extension to your Kogito and OptaPlanner applications.
ja_jp: しかし、1つの変更点があります。もし、まだそうしていないのであれば、KogitoとOptaPlannerのアプリケーションに `quarkus-resteasy-jackson` のエクステンションを明示的に追加する必要があります。

source: There is one default classifier which assigns a cohort based on a hash of the remote IP address and current time, such that an IP address changes its cohort roughly every hour. It declares no `@Priority`.
ja_jp: リモート IP アドレスと現在の時刻のハッシュに基づいてコホートを割り当てるデフォルトの分類子が 1 つあり、IP アドレスのコホートはおよそ 1 時間ごとに変更されます。 `@Priority` は宣言されていません。

source: There is one default prioritizer which assigns the priority of `CRITICAL` to requests to the non-application endpoints. It declares no `@Priority`.
ja_jp: デフォルトの prioritizer が 1 つあり、非アプリケーションエンドポイントへのリクエストには優先度 `CRITICAL` が割り当てられます。 `@Priority` は宣言されていません。

source: There is one detail to mention. If an old message is neither acked nor nacked, the strategy cannot commit the position anymore. It will enqueue messages forever, waiting for that missing ack to happen. It can lead to out of memory, as the connector would never be able to commit a position and to clear the queue. Fortunately, the strategy detects this situation and reports a failure to the connector, marking the application unhealthy. The `throttled.unprocessed-record-max-age.ms` attribute configures the deadline for each message to be acked or nacked before being considered as a poison pill (Default is 1 minute).
ja_jp: 一つだけ注意すべき点があります。古いメッセージが ack されず、nack されない場合、ストラテジーはもうポジションをコミットすることができません。それは永遠にメッセージをエンキューし、その欠落したアックが起こるのを待ちます。これは、コネクタがポジションをコミットしてキューをクリアすることができなくなるため、メモリー不足につながる可能性があります。幸いなことに、このストラテジーはこの状況を検出してコネクタに失敗を報告し、アプリケーションが不健全であることをマークします。 `throttled.unprocessed-record-max-age.ms` 属性は、ポイズンピルとみなされる前に、各メッセージが ack されるか nacked されるかの期限を設定します (デフォルトは 1 分です)。

source: There is one significant drawback of this "late initialization" approach. An _uninitialized_ bean may be accessed by other extensions or application components that are instantiated during bootstrap. We'll cover a more robust solution in the <<synthetic_beans>>.
ja_jp: この「遅延初期化」アプローチには、1 つの重大な欠点があります。 _初期化されていない_ Bean は、ブートストラップ中にインスタンス化された他のエクステンションやアプリケーションコンポーネントからアクセスされる可能性があります。 <<synthetic_beans>> で、より堅牢な解決策を取り上げます。

source: There is only one important guideline in Quarkus observability:
ja_jp: Quarkus のオブザーバビリティーには重要なガイドラインが 1 つだけあります。

source: There is only one thing to remember: if you use `Response` and Quarkus can't determine the beans that are serialized, you need to annotate them with `@RegisterForReflection`.
ja_jp: 覚えておくべきことは一つだけあります。 `Response` を使用していて、Quarkus がシリアライズされているBeanを特定できない場合は、 `@RegisterForReflection` を使ってアノテーションを付ける必要があります。

source: There is only one thing to remember: if you use `Response` and Quarkus cannot determine the beans that are serialized, you need to annotate them with `@RegisterForReflection`.
ja_jp: `Response` を使用していて、Quarkus がシリアライズされている Bean を特定できない場合は、 `@RegisterForReflection` を使ってアノテーションを付ける必要があることに注意してください。

source: There may be situations where the URL of the registry changes, however the ID needs to be the same (because the Maven coordinates are queried). To override the registry URL, add the following:
ja_jp: レジストリのURLが変更される場合がありますが、IDは同じである必要があります。（Mavenの座標が照会されるため）レジストリのURLを上書きするには、次のように追加します:

source: There might be cases where JWT tokens must be verified through introspection only, which can be forced by configuring an introspection endpoint address only. The following properties configuration shows you an example of how you can achieve this with Keycloak:
ja_jp: 場合によっては、JWT トークンをイントロスペクションのみで検証しなければならないことがあります。これは、イントロスペクションエンドポイントアドレスのみを設定することで強制できます。 次のプロパティー設定は、これを Keycloak を使用して実現する方法の例を示しています。

source: There might be cases where you develop an extension outside of Quarkus core (like Quarkiverse), so your quarkus version is not `999-SNAPSHOT`. In that case you can still enable the Dev UI log with this application property: `quarkus.dev-ui.show-json-rpc-log=true`
ja_jp: Quarkus コアの外部でエクステンション (Quarkiverse など) を開発している場合、Quarkus のバージョンが `999-SNAPSHOT` ではないことがあります。その場合でも、このアプリケーションプロパティー `quarkus.dev-ui.show-json-rpc-log=true` を使用して Dev UI Log を有効にできます。

source: There might be other configuration properties (depending on the extensions added to the application) that have no effect in dev mode.
ja_jp: (アプリケーションに追加されたエクステンションに応じて) 他の設定プロパティがあるかもしれませんが、開発モードでは影響がありません。

source: There might be other configuration properties (depending on the extensions added to the application) that have no effect in dev-mode.
ja_jp: （アプリケーションに追加されたエクステンションに応じて）他の設定プロパティがあるかもしれませんが、dev-modeでは影響がありません。

source: There must be exactly one constructor of a custom `Permission` class. The first parameter is always considered to be a permission name and must be of type `String`. Quarkus can optionally pass permission actions to the constructor. For this to happen, declare the second parameter as `String[]`.
ja_jp: カスタム `Permission` クラスのコンストラクターは 1 つだけ存在する必要があります。 最初のパラメーターは常に権限名とみなされ、 `String` 型である必要があります。 Quarkus はオプションでコンストラクターに権限アクションを渡すことができます。 これを実現するには、2 番目のパラメーターを `String[]` として宣言します。

source: There must be exactly two permission checker methods, one for the `delete:service` permission and other for the `delete:file` permission.
ja_jp: 権限チェッカーメソッドは 2 つ必要です。1 つは `delete:service` 権限用、もう 1 つは `delete:file` 権限用です。

source: There should be both blocking and reactive examples as much as possible.
ja_jp: なるべくブロック型とリアクティブ型の両方の例があることが望ましい

source: There you go. With just a few easy steps you can use the power of React and Patternfly to add slick looking interactive GUIs to your Quarkus apps.
ja_jp: いくつかの簡単なステップで、ReactとPatternflyの力を使って、Quarkusアプリに洗練された見た目のインタラクティブなGUIを追加することができます。

source: There's a trigger YAML file for each of our 4 Funqy functions. Deploy them all:
ja_jp: 4つのFunqy関数ごとにTrigger YAMLファイルが用意されています。これらをすべてデプロイします:

source: There's also a convenient annotation to access enum constants: `@io.quarkus.qute.TemplateEnum`. This annotation is functionally equivalent to `@TemplateData(namespace = TemplateData.SIMPLENAME)`, i.e. a namespace resolver is automatically generated for the target enum and the simple name of the target enum is used as the namespace.
ja_jp: また、enum 定数にアクセスするための便利なアノテーションとして、`@io.quarkus.qute.TemplateEnum` があります。このアノテーションは、機能的には `@TemplateData(namespace = TemplateData.SIMPLENAME)` と同等です。つまり、対象の enum に対して自動的に名前空間リゾルバーが生成され、対象の enum の単純名が名前空間として使用されます。

source: There's also an equivalent of `@BindingsSource`. The `injectInterceptionProxy()` method has an overload with a parameter:
ja_jp: `@BindingsSource` に相当するものもあります。 `injectInterceptionProxy()` メソッドには、パラメーターが １ つ指定されたオーバーロードがあります。

source: There's also the question of throughput. We haven't collected throughput numbers ourselves, as we didn't have the proper setup, but some of our colleagues are running tests in an isolated environment, and recently published https://quarkus.io/blog/new-benchmarks/[new benchmark results]. Native executables usually result in lower throughput, at least with what is available as Open Source today in Mandrel and GraalVM CE.
ja_jp: スループットの問題もあります。適切なセットアップがなかったため、私たちはスループットの数値を独自に収集していませんが、一部の同僚が隔離された環境でテストを実行しており、最近 https://quarkus.io/blog/new-benchmarks/[新しいベンチマーク結果] を公開しました。ネイティブ実行可能ファイルは、少なくとも Mandrel と GraalVM CE で今日オープンソースとして利用できるものについては、通常、スループットが低くなる傾向があります。

source: There's an alternate way to declare your templates in your Java code, which relies on the following convention:
ja_jp: Java コードでテンプレートを宣言する別の方法もあり、以下の規約に依存しています。

source: There's another, more subtle, omission in our charts that also contributes to misunderstanding about Quarkus. We show the performance of Quarkus in native mode, but we don't show the performance of the other framework in native mode. Some people take this to mean that Quarkus is all about native mode, and if they're using Quarkus, they should be using native mode. We often see blogs which compare Quarkus in native mode to other frameworks in JVM mode, which is just silly. Quarkus in JVM mode should be compared to other frameworks in JVM mode, and Quarkus in native mode should be compared to other frameworks in native mode. Quarkus happens to be very good at native mode, but whether you want to use native mode is an orthogonal choice to what framework you choose.
ja_jp: 私たちのチャートには、Quarkusに関する誤解の一因となっている、もう一つのより微妙な省略があります。私たちはQuarkusのネイティブモードでのパフォーマンスを示していますが、他のフレームワークのネイティブモードでのパフォーマンスは示していません。一部の人々は、これがQuarkusはネイティブモードがすべてであり、Quarkusを使用するならネイティブモードを使用すべきだと解釈します。Quarkusをネイティブモードで、他のフレームワークをJVMモードで比較するブログをよく見かけますが、これは単に愚かです。QuarkusをJVMモードで使う場合は他のフレームワークをJVMモードで使う場合と比較すべきであり、Quarkusをネイティブモードで使う場合は他のフレームワークをネイティブモードで使う場合と比較すべきです。Quarkusはネイティブモードに非常に優れていますが、ネイティブモードを使用するかどうかは、どのフレームワークを選択するかとは直交する選択肢です。

source: There's more about producers. You can declare qualifiers, inject dependencies into the producer methods parameters, etc. You can read more about producers for example in the https://docs.jboss.org/weld/reference/latest/en-US/html/producermethods.html[Weld docs, window="_blank"].
ja_jp: プロデューサーについては他にもあります。修飾子を宣言したり、プロデューサーメソッドのパラメーターに依存性を注入したりすることができます。プロデューサについては、例えば link:https://docs.jboss.org/weld/reference/latest/en-US/html/producermethods.html[Weld, window=_blank] のドキュメントを参照してください。

source: There's no Dev Services support for Confluent Schema Registry. If you want to use a running instance of Confluent Schema Registry, configure its URL, together with the URL of a Kafka broker:
ja_jp: Confluent Schema Registry の Dev Services サポートはありません。Confluent Schema Registry の実行中のインスタンスを使用したい場合は、Kafka ブローカーの URL と一緒にその URL を設定します：

source: There's no actual queue of requests that we could monitor, though, so the algorithm estimates the current length of a request queue based on previously seen response times. The longer recent requests take, compared to the recent lowest response time, the longer the queue is supposed to be.
ja_jp: ただし、監視できる実際のリクエストキューはないため、このアルゴリズムは以前に観測された応答時間に基づいてリクエストキューの現在の長さを推定します。最近のリクエストが、最近の最低応答時間と比較して長くかかるほど、キューも長いと推定されます。

source: Therefore the other option, indirect access token verification, where the access token is used to acquire `UserInfo` from Auth0 can be used to accept and verify opaque Auth0 tokens. This option works because OIDC providers have to verify access tokens before they can issue `UserInfo` and Auth0 has a `UserInfo` endpoint.
ja_jp: この場合は、別のオプションを使用できます。つまり、アクセストークンを使用して Auth0 から `UserInfo` を取得し、間接的にアクセストークンを検証するというもう 1 つのオプションを使用して、不透明な Auth0 トークンを受け入れ、検証できます。OIDC プロバイダーは `UserInfo` を発行する前にアクセストークンを検証する必要があり、Auth0 には `UserInfo` エンドポイントがあるため、このオプションが機能します。

source: Therefore, UserInfo is embedded in an internally generated ID token and is encrypted in the session cookie. You can disable it with `quarkus.oidc.cache-user-info-in-idtoken=false`.
ja_jp: したがって、UserInfo は内部で生成された ID トークンに埋め込まれ、セッション Cookie で暗号化されます。 `quarkus.oidc.cache-user-info-in-idtoken=false` で無効化できます。

source: Therefore, `UserInfo` is embedded in the internal generated `IdToken` and saved in the encrypted session cookie. It can be disabled with `quarkus.oidc.cache-user-info-in-idtoken=false`.
ja_jp: したがって、 `UserInfo` は内部で生成された `IdToken` に埋め込まれ、暗号化されたセッション Cookie に保存されます。これは `quarkus.oidc.cache-user-info-in-idtoken=false` で無効にできます。

source: Therefore, `UserInfo` is embedded in the internally generated `IdToken` and saved in the encrypted session cookie. It can be disabled with `quarkus.oidc.cache-user-info-in-idtoken=false`.
ja_jp: したがって、 `UserInfo` は内部で生成された `IdToken` に埋め込まれ、暗号化されたセッション Cookie に保存されます。 これは `quarkus.oidc.cache-user-info-in-idtoken=false` で無効にできます。

source: Therefore, a proper way to execute long tasks is to offload them from the scheduled method to a custom executor service. Here's an example of such setup for a long-running task that we do not expect to execute often:
ja_jp: したがって、長いタスクを実行する適切な方法は、スケジュールメソッドからカスタム実行サービスにオフロードすることです。以下は、頻繁に実行されるとは思っていない長時間タスクのセットアップの例です：

source: Therefore, enabling the Object Mapper requires two steps:
ja_jp: そのため、Object Mapperを有効にするには、2つのステップが必要です:

source: Therefore, go to https://code.quarkus.io[code.quarkus.io, window="_blank"], create a new project with the aloha extension and `org.acme` as Group (i.e <<org-acme-package>>). Prepare a nice starter. It should not include any business logic, instead, it should contain some stub data/hello world that compiles and gives an overview of how to use the extension. The idea is to bring code that is the most common starting point for the extension.
ja_jp: したがって、 https://code.quarkus.io[code.quarkus.io, window="_blank"] に移動し、aloha エクステンションとグループとして `org.acme` を使用して新しいプロジェクトを作成します (つまり、 <<org-acme-package>> )。素敵なスターターを用意してください。ビジネスロジックを含める必要はありません。代わりに、コンパイルしてエクステンションの使用方法の概要を示すスタブデータ/Hello World を含める必要があります。このアイデアは、エクステンションの最も一般的な開始点となるコードを提供することにあります。
